In [1]:
import sys
import pandas as pd
import os
from pprint import pprint as pp
df = pd.read_csv("titanic.csv")
!python3.7 --version

Python 3.7.0

In [2]:
pp([sys.version, os.getcwd(), df.head()])

['3.7.0 (default, Aug 25 2018, 20:44:19) \n[GCC 7.3.0]',
 '/doogle/githubrepos/datawrangling/datawarangling',
    passenger_id  pclass                                               name  \
0          1216       3                                 Smyth, Miss. Julia
1           699       3                                    Cacic, Mr. Luka
2          1267       3  Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...
3           449       2              Hocking, Mrs. Elizabeth (Eliza Needs)
4           576       2                                    Veal, Mr. James

      sex   age  sibsp  parch  ticket     fare cabin embarked boat  body  \
0  female   NaN      0      0  335432   7.7333   NaN        Q   13   NaN
1    male  38.0      0      0  315089   8.6625   NaN        S  NaN   NaN
2  female  30.0      1      1  345773  24.1500   NaN        S  NaN   NaN
3  female  54.0      1      3   29105  23.0000   NaN        S    4   NaN
4    male  40.0      0      0   28221  13.0000   NaN        S  NaN   NaN

                  home.dest  survived
0                       NaN         1
1                   Croatia         0
2                       NaN         0
3      Cornwall / Akron, OH         1
4  Barre, Co Washington, VT         0  ]

In [3]:
df.drop(df.columns[[2]], axis=1, inplace=True)
pp(df.head())

   passenger_id  pclass     sex   age  sibsp  parch  ticket     fare cabin  \
0          1216       3  female   NaN      0      0  335432   7.7333   NaN
1           699       3    male  38.0      0      0  315089   8.6625   NaN
2          1267       3  female  30.0      1      1  345773  24.1500   NaN
3           449       2  female  54.0      1      3   29105  23.0000   NaN
4           576       2    male  40.0      0      0   28221  13.0000   NaN

  embarked boat  body                 home.dest  survived
0        Q   13   NaN                       NaN         1
1        S  NaN   NaN                   Croatia         0
2        S  NaN   NaN                       NaN         0
3        S    4   NaN      Cornwall / Akron, OH         1
4        S  NaN   NaN  Barre, Co Washington, VT         0

In [4]:
pp([df.iloc[0], df.iloc[0:8], df.loc[:, ['passenger_id']]])

[passenger_id      1216
pclass               3
sex             female
age                NaN
sibsp                0
parch                0
ticket          335432
fare            7.7333
cabin              NaN
embarked             Q
boat                13
body               NaN
home.dest          NaN
survived             1
Name: 0, dtype: object,
    passenger_id  pclass     sex   age  sibsp  parch  ticket     fare cabin  \
0          1216       3  female   NaN      0      0  335432   7.7333   NaN
1           699       3    male  38.0      0      0  315089   8.6625   NaN
2          1267       3  female  30.0      1      1  345773  24.1500   NaN
3           449       2  female  54.0      1      3   29105  23.0000   NaN
4           576       2    male  40.0      0      0   28221  13.0000   NaN
5          1083       3    male  28.0      0      0  C 4001  22.5250   NaN
6           898       3    male  19.0      0      0    LINE   0.0000   NaN
7           560       2  female  30.0      0      0  250648  13.0000   NaN

  embarked boat   body                 home.dest  survived
0        Q   13    NaN                       NaN         1
1        S  NaN    NaN                   Croatia         0
2        S  NaN    NaN                       NaN         0
3        S    4    NaN      Cornwall / Akron, OH         1
4        S  NaN    NaN  Barre, Co Washington, VT         0
5        S  NaN  173.0                       NaN         0
6        S  NaN    NaN                       NaN         0
7        S   10    NaN  Finland / Washington, DC         1  ,
      passenger_id
0            1216
1             699
2            1267
3             449
4             576
5            1083
6             898
7             560
8            1079
9             908
10            313
11             43
12            233
13            446
14            602
15            884
16            497
17           1003
18             36
19           1088
20            978
21           1030
22            438
23            766
24            661
25            556
26           1008
27            575
28            775
29            162
..            ...
820          1167
821          1123
822           754
823           855
824          1188
825           693
826           253
827           892
828          1245
829            94
830           104
831           217
832           306
833           487
834            61
835           345
836           107
837           102
838           333
839            62
840          1256
841           208
842           709
843          1288
844           165
845           158
846           174
847           467
848          1112
849           425

[850 rows x 1 columns]]

In [5]:
df = pd.read_csv("titanic.csv")
meanagedf = df.groupby(["pclass"])["age"].mean().reset_index()
pp((df.head(), df.loc[:,['name', 'age']], df[df["name"] == "Hoyt, Mr. Frederick Maxfield" ], df.groupby(["sex", "survived"])["passenger_id"].count(), df.groupby(["pclass"])["age"].mean(),
meanagedf))

(   passenger_id  pclass                                               name  \
0          1216       3                                 Smyth, Miss. Julia
1           699       3                                    Cacic, Mr. Luka
2          1267       3  Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...
3           449       2              Hocking, Mrs. Elizabeth (Eliza Needs)
4           576       2                                    Veal, Mr. James

      sex   age  sibsp  parch  ticket     fare cabin embarked boat  body  \
0  female   NaN      0      0  335432   7.7333   NaN        Q   13   NaN
1    male  38.0      0      0  315089   8.6625   NaN        S  NaN   NaN
2  female  30.0      1      1  345773  24.1500   NaN        S  NaN   NaN
3  female  54.0      1      3   29105  23.0000   NaN        S    4   NaN
4    male  40.0      0      0   28221  13.0000   NaN        S  NaN   NaN

                  home.dest  survived
0                       NaN         1
1                   Croatia         0
2                       NaN         0
3      Cornwall / Akron, OH         1
4  Barre, Co Washington, VT         0  ,
                                                   name   age
0                                   Smyth, Miss. Julia   NaN
1                                      Cacic, Mr. Luka  38.0
2    Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...  30.0
3                Hocking, Mrs. Elizabeth (Eliza Needs)  54.0
4                                      Veal, Mr. James  40.0
5                             Olsen, Mr. Henry Margido  28.0
6                      Johnson, Mr. William Cahoone Jr  19.0
7                                Sinkkonen, Miss. Anna  30.0
8                                   Ohman, Miss. Velin  22.0
9                             Jussila, Miss. Mari Aina  21.0
10                           Widener, Mr. Harry Elkins  27.0
11     Bucknell, Mrs. William Robert (Emma Eliza Ward)  60.0
12       Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0
13                       Hocking, Miss. Ellen "Nellie"  20.0
14                         Abbott, Mr. Rossmore Edward  16.0
15                             Jensen, Mr. Niels Peder  48.0
16                           Maybery, Mr. Frank Hubert  40.0
17                                  McCoy, Mr. Bernard   NaN
18                         Bowerman, Miss. Elsie Edith  22.0
19                           Olsson, Mr. Oscar Wilhelm  32.0
20                                   Lulic, Mr. Nikola  27.0
21                                    Moran, Mr. James   NaN
22                                  Herman, Miss. Kate  24.0
23                                  Delalic, Mr. Redjo  25.0
24                          Badman, Miss. Emily Louisa  18.0
25                         Sharp, Mr. Percival James R  27.0
26                            McGowan, Miss. Katherine  35.0
27   Turpin, Mrs. William John Robert (Dorothy Ann ...  27.0
28                                 Doharr, Mr. Tannous   NaN
29                      Holverson, Mr. Alexander Oskar  42.0
..                                                 ...   ...
820                               Sadlier, Mr. Matthew   NaN
821             Peter, Mrs. Catherine (Catherine Rizk)   NaN
822                            Davies, Mr. John Samuel  21.0
823                           Hassan, Mr. Houssein G N  11.0
824  Sandstrom, Mrs. Hjalmar (Agnes Charlotta Bengt...  24.0
825                                Buckley, Mr. Daniel  21.0
826    Ryerson, Mrs. Arthur Larned (Emily Maria Borie)  48.0
827                          Johansson, Mr. Karl Johan  31.0
828                    Thomson, Mr. Alexander Morrison   NaN
829                          Dodge, Master. Washington   4.0
830                     Eustis, Miss. Elizabeth Mussey  54.0
831                       Nicholson, Mr. Arthur Ernest  64.0
832                        White, Mr. Percival Wayland  54.0
833                                  Lingane, Mr. John  61.0
834  Cavendish, Mrs. Tyrell William (Julia Florence...  76.0
835                         Berriman, Mr. William John  23.0
836               Flegenheim, Mrs. Alfred (Antoinette)   NaN
837              Earnshaw, Mrs. Boulton (Olive Potter)  23.0
838                            Ball, Mrs. (Ada E Hall)  36.0
839                        Chaffee, Mr. Herbert Fuller  46.0
840                     Touma, Master. Georges Youssef   7.0
841    Minahan, Mrs. William Edward (Lillian E Thorpe)  37.0
842                          Carr, Miss. Helen "Ellen"  16.0
843                          Wiklund, Mr. Jakob Alfred  18.0
844                       Hoyt, Mr. Frederick Maxfield  38.0
845                        Hipkins, Mr. William Edward  55.0
846                            Kent, Mr. Edward Austin  58.0
847                Kantor, Mrs. Sinai (Miriam Sternin)  24.0
848                          Peacock, Miss. Treasteall   3.0
849                              Greenberg, Mr. Samuel  52.0

[850 rows x 2 columns],
      passenger_id  pclass                          name   sex   age  sibsp  \
844           165       1  Hoyt, Mr. Frederick Maxfield  male  38.0      1

     parch ticket  fare cabin embarked boat  body  \
844      0  19943  90.0   C93        S    D   NaN

                       home.dest  survived
844  New York, NY /  Stamford CT         1  ,
 sex     survived
female  0            89
        1           210
male    0           448
        1           103
Name: passenger_id, dtype: int64,
 pclass
1    39.110960
2    28.601496
3    24.693949
Name: age, dtype: float64,
    pclass        age
0       1  39.110960
1       2  28.601496
2       3  24.693949)

In [6]:
print(df.head())

   passenger_id  pclass                                               name  \
0          1216       3                                 Smyth, Miss. Julia
1           699       3                                    Cacic, Mr. Luka
2          1267       3  Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...
3           449       2              Hocking, Mrs. Elizabeth (Eliza Needs)
4           576       2                                    Veal, Mr. James

      sex   age  sibsp  parch  ticket     fare cabin embarked boat  body  \
0  female   NaN      0      0  335432   7.7333   NaN        Q   13   NaN
1    male  38.0      0      0  315089   8.6625   NaN        S  NaN   NaN
2  female  30.0      1      1  345773  24.1500   NaN        S  NaN   NaN
3  female  54.0      1      3   29105  23.0000   NaN        S    4   NaN
4    male  40.0      0      0   28221  13.0000   NaN        S  NaN   NaN

                  home.dest  survived
0                       NaN         1
1                   Croatia         0
2                       NaN         0
3      Cornwall / Akron, OH         1
4  Barre, Co Washington, VT         0

In [7]:
df.drop(df.columns[[0,2]], axis=1, inplace=True)
# df.drop(df.columns([0]), axis=1, inplace=True)

In [9]:
print(df.head())

   pclass     sex   age  sibsp  parch  ticket     fare cabin embarked boat  \
0       3  female   NaN      0      0  335432   7.7333   NaN        Q   13
1       3    male  38.0      0      0  315089   8.6625   NaN        S  NaN
2       3  female  30.0      1      1  345773  24.1500   NaN        S  NaN
3       2  female  54.0      1      3   29105  23.0000   NaN        S    4
4       2    male  40.0      0      0   28221  13.0000   NaN        S  NaN

   body                 home.dest  survived
0   NaN                       NaN         1
1   NaN                   Croatia         0
2   NaN                       NaN         0
3   NaN      Cornwall / Akron, OH         1
4   NaN  Barre, Co Washington, VT         0

### Pandas Key Functions/Methods
### isnull() dropna() fillna() duplicated() drop_duplicates() set_index()